Repository: Boe-l/Kanjilogia
Catalog: lib/l10n/app_*.arb
Languages: ar, bn, de, fr, hi, it, jp, ko, tr

# language
source: English
ar: العربية
bn: বাংলা
de: Deutsch
fr: Français
hi: हिन्दी
it: Italiano
jp: 日本語
ko: 한국어
tr: Türkçe

# tutorial1
source: Game Tutorial
ar: دليل اللعبة
bn: গেম টিউটোরিয়াল
de: Spielanleitung
fr: Tutoriel du jeu
hi: गेम ट्यूटोरियल
it: Tutorial del gioco
jp: ゲームチュートリアル
ko: 게임 튜토리얼
tr: Oyun Eğitimi

# tutorial2
source: Select one or more items to play.
ar: حدد عنصرًا أو أكثر للعب.
bn: খেলার জন্য একটি বা একাধিক আইটেম নির্বাচন করুন।
de: Wählen Sie ein oder mehrere Elemente zum Spielen aus.
fr: Sélectionnez un ou plusieurs éléments pour jouer.
hi: खेलने के लिए एक या अधिक आइटम चुनें।
it: Seleziona uno o più elementi per giocare.
jp: プレイするアイテムを1つ以上選択してください。
ko: 게임할 항목을 하나 이상 선택하세요.
tr: Oynatmak için bir veya birden fazla öğe seçin.

# tutorial3
source: Start the game
ar: بدء اللعبة
bn: গেম শুরু করুন
de: Spiel starten
fr: Commencer le jeu
hi: गेम शुरू करें
it: Inizia il gioco
jp: ゲームを開始する
ko: 게임 시작하기
tr: Oyuna Başla

# tutorial4
source: After selecting the items to play, click here to start the game.
ar: بعد تحديد العناصر للعب، انقر هنا لبدء اللعبة.
bn: খেলার জন্য আইটেম নির্বাচন করার পর, গেম শুরু করতে এখানে ক্লিক করুন।
de: Nachdem Sie die Elemente zum Spielen ausgewählt haben, klicken Sie hier, um das Spiel zu starten.
fr: Après avoir sélectionné les éléments à jouer, cliquez ici pour commencer le jeu.
hi: खेलने के लिए आइटम चुनने के बाद, गेम शुरू करने के लिए यहाँ क्लिक करें।
it: Dopo aver selezionato gli elementi da giocare, clicca qui per avviare il gioco.
jp: アイテムを選択したら、ここをクリックしてゲームを開始してください。
ko: 게임할 항목을 선택한 후 여기를 클릭하여 게임을 시작합니다.
tr: Oynatmak için öğeleri seçtikten sonra, oyuna başlamak için buraya tıklayın.

# tutorial5
source: Game Settings
ar: إعدادات اللعبة
bn: গেম সেটিংস
de: Spieleinstellungen
fr: Paramètres du jeu
hi: गेम सेटिंग्स
it: Impostazioni del gioco
jp: ゲーム設定
ko: 게임 설정
tr: Oyun Ayarları

# tutorial6
source: Click here to change the response time, add more files to the game or delete them.
ar: انقر هنا لتغيير وقت الاستجابة أو إضافة ملفات أخرى للعبة أو حذفها.
bn: এখানে ক্লিক করুন সময়ের প্রতিক্রিয়া পরিবর্তন করতে, আরও ফাইল যোগ করতে বা মুছে ফেলতে।
de: Klicken Sie hier, um die Antwortzeit zu ändern, mehr Dateien zum Spiel hinzuzufügen oder sie zu löschen.
fr: Cliquez ici pour modifier le temps de réponse, ajouter plus de fichiers au jeu ou les supprimer.
hi: यहाँ क्लिक करें, ताकि आप उत्तर का समय बदल सकें, गेम में अधिक फाइलें जोड़ सकें या उन्हें हटा सकें।
it: Clicca qui per modificare il tempo di risposta, aggiungere o eliminare file dal gioco.
jp: ここをクリックして、応答時間を変更したり、ゲームにファイルを追加したり削除したりできます。
ko: 여기를 클릭하여 응답 시간을 변경하거나 게임에 파일을 추가하거나 삭제할 수 있습니다.
tr: Yanıt süresini değiştirmek, oyuna daha fazla dosya eklemek veya silmek için buraya tıklayın.

# tutorial_skip
source: Skip
ar: تخطي
bn: এড়িয়ে যান
de: Überspringen
fr: Passer
hi: स्किप करें
it: Salta
jp: スキップ
ko: 건너뛰기
tr: Atla

# main_searchtooltip
source: Search...
ar: بحث...
bn: অনুসন্ধান করুন...
de: Suchen...
fr: Rechercher...
hi: खोजें...
it: Cerca...
jp: 検索...
ko: 검색...
tr: Ara...

# main_files_empty
source: No files found.
ar: لم يتم العثور على أي ملفات.
bn: কোনও ফাইল পাওয়া যায়নি।
de: Keine Dateien gefunden.
fr: Aucun fichier trouvé.
hi: कोई फाइल नहीं मिली।
it: Nessun file trovato.
jp: ファイルが見つかりません。
ko: 파일을 찾을 수 없습니다.
tr: Hiç dosya bulunamadı.

# dialogue1
source: Select at least one item to play.
ar: حدد عنصرًا واحدًا على الأقل للعب.
bn: খেলার জন্য অন্তত একটি আইটেম নির্বাচন করুন।
de: Wählen Sie mindestens ein Element zum Spielen aus.
fr: Sélectionnez au moins un élément pour jouer.
hi: कम से कम एक आइटम चुनें ताकि आप खेल सकें।
it: Seleziona almeno un elemento per giocare.
jp: ゲームをプレイするために1つ以上のアイテムを選択してください。
ko: 게임할 항목을 하나 이상 선택하세요.
tr: Oynamak için en az bir öğe seçin.

# gs_words_empty
source: No words available!
ar: لا توجد كلمات متاحة!
bn: কোনও শব্দ উপলব্ধ নেই!
de: Keine verfügbaren Wörter!
fr: Aucun mot disponible !
hi: कोई शब्द उपलब्ध नहीं है!
it: Nessuna parola disponibile!
jp: 利用可能な単語がありません！
ko: 사용 가능한 단어가 없습니다!
tr: Hiç kelime bulunamadı!

# gs_points
source: {score} Points
ar: {score} نقاط
bn: {score} পয়েন্ট
de: {score} Punkte
hi: {score} अंक
it: {score} Punti
jp: {score} ポイント
ko: {score} 점
tr: {score} Puan

# gs_search_tooltip
source: Write the reading
ar: اكتب القراءة
bn: পঠন লিখুন
de: Geben Sie die Lesung ein
fr: Entrez la lecture
hi: पढ़ाई लिखाई दर्ज करें
it: Scrivi la lettura
jp: 読みを入力
ko: 읽기 입력
tr: Okumayı yazın

# gs_game_ended1
source: Game Over!
ar: تم إنهاء اللعبة!
bn: গেম সমাপ্ত!
de: Spiel beendet!
fr: Jeu terminé !
hi: गेम समाप्त!
it: Gioco Terminato!
jp: ゲーム終了！
ko: 게임 종료!
tr: Oyun Bitti!

# gs_game_ended2
source: Game Over {score} points
ar: تم إنهاء اللعبة {score} نقاط
bn: গেম সমাপ্ত {score} পয়েন্ট
de: Spiel beendet {score} Punkte
fr: Jeu terminé {score} points
hi: गेम समाप्त {score} अंक
it: Gioco Terminato {score} punti
jp: ゲーム終了 {score} ポイント
ko: 게임 종료 {score} 점
tr: Oyun Bitti {score} puan

# gs_game_ended3
source: Congratulations on completing the game! What would you like to do now?
ar: تهانينا على إتمام اللعبة! ماذا تريد أن تفعل الآن؟
bn: গেম সম্পূর্ণ করার জন্য অভিনন্দন! এখন আপনি কি করতে চান?
de: Herzlichen Glückwunsch zum Abschluss des Spiels! Was möchten Sie jetzt tun?
fr: Félicitations pour avoir terminé le jeu ! Que voulez-vous faire maintenant ?
hi: बधाई हो! आपने गेम पूरा किया! अब आप क्या करना चाहते हैं?
it: Congratulazioni per aver completato il gioco! Cosa desideri fare ora?
jp: ゲームを完了しました！次に何をしますか？
ko: 게임을 완료했습니다! 지금 무엇을 하시겠습니까?
tr: Oyunu bitirdiğiniz için tebrikler! Şimdi ne yapmak istersiniz?

# gs_game_restart
source: Restart
ar: إعادة التشغيل
bn: রিস্টার্ট
de: Neu starten
fr: Redémarrer
hi: पुनः आरंभ करें
it: Ricomincia
jp: 再起動
ko: 다시 시작
tr: Yeniden Başlat

# gs_game_restart2
source: Restart Game
ar: إعادة تشغيل اللعبة
bn: গেম রিস্টার্ট
de: Spiel neu starten
fr: Redémarrer le jeu
hi: गेम पुनः शुरू करें
it: Ricominciare il gioco
jp: ゲームを再起動
ko: 게임 다시 시작
tr: Oyunu Yeniden Başlat

# gs_go_main_menu
source: Go to Main Menu
ar: العودة إلى القائمة الرئيسية
bn: প্রধান মেনুতে ফিরে যান
de: Zum Hauptmenü zurückkehren
fr: Retour au menu principal
hi: मुख्य मेनू में जाएं
it: Torna al menu principale
jp: メインメニューに戻る
ko: 메인 메뉴로 돌아가기
tr: Ana Menüye Geri Dön

# gs_open_history
source: View History
ar: عرض السجل
bn: ইতিহাস দেখুন
de: Verlauf anzeigen
fr: Voir l'historique
hi: इतिहास देखें
it: Visualizza la cronologia
jp: 履歴を見る
ko: 기록 보기
tr: Geçmişi Görüntüle

source: Close
ar: إغلاق
bn: বন্ধ করুন
de: Schließen
fr: Fermer
hi: बंद करें
it: Chiudi
jp: 閉じる
ko: 닫기
tr: Kapat

# go_back
source: Back
ar: رجوع
bn: ফিরে যান
de: Zurück
fr: Retour
hi: वापस जाएं
it: Indietro
jp: 戻る
ko: 뒤로 가기
tr: Geri Git

# go_cancel
source: Cancel
ar: إلغاء
bn: বাতিল করুন
de: Abbrechen
fr: Annuler
hi: रद्द करें
it: Annulla
jp: キャンセル
ko: 취소
tr: İptal Et

source: Add
ar: إضافة
bn: যোজন করুন
de: Hinzufügen
fr: Ajouter
hi: जोड़ें
it: Aggiungi
jp: 追加
ko: 추가
tr: Ekle

# gs_history
source: Answer History
ar: سجل الإجابات
bn: উত্তরের ইতিহাস
de: Antwortverlauf
fr: Historique des réponses
hi: उत्तर का इतिहास
it: Cronologia delle risposte
jp: 履歴
ko: 응답 기록
tr: Yanıt Geçmişi

# gs_history_correct
source: Correct
ar: الإجابات الصحيحة
bn: সঠিক উত্তর
de: Korrekte Antworten
fr: Réponses correctes
hi: सही उत्तर
it: Corretti
jp: 正解
ko: 정답
tr: Doğru Cevaplar

# gs_history_mistake
source: Mistakes
ar: الأخطاء
bn: ভুল উত্তর
de: Fehler
fr: Erreurs
hi: गलत उत्तर
it: Errori
jp: 間違い
ko: 오답
tr: Yanlış Cevaplar

# gs_see_full_history
source: View Full History
ar: عرض السجل الكامل
bn: সম্পূর্ণ ইতিহাস দেখুন
de: Vollen Verlauf anzeigen
fr: Voir l'historique complet
hi: पूरा इतिहास देखें
it: Visualizza cronologia completa
jp: 履歴全体を見る
ko: 전체 기록 보기
tr: Tam Geçmişi Görüntüle

# gs_history_copy_single
source: Entry copied to clipboard!
ar: تم نسخ المدخل إلى الحافظة!
bn: এন্ট্রি ক্লিপবোর্ডে কপি করা হয়েছে!
de: Eintrag in die Zwischenablage kopiert!
fr: Entrée copiée dans le presse-papier !
hi: प्रविष्टि क्लिपबोर्ड पर कॉपी की गई!
it: Voce copiata negli appunti!
jp: エントリーがクリップボードにコピーされました！
ko: 항목이 클립보드에 복사되었습니다!
tr: Girdi panoya kopyalandı!

# gs_history_copy_all_correct
source: All correct answers copied to clipboard!
ar: تم نسخ جميع الإجابات الصحيحة إلى الحافظة!
bn: সমস্ত সঠিক উত্তর ক্লিপবোর্ডে কপি করা হয়েছে!
de: Alle korrekten Antworten in die Zwischenablage kopiert!
fr: Toutes les bonnes réponses copiées dans le presse-papier !
hi: सभी सही उत्तर क्लिपबोर्ड पर कॉपी किए गए!
it: Tutti i corretti copiati negli appunti!
jp: すべての正解がクリップボードにコピーされました！
ko: 모든 정답이 클립보드에 복사되었습니다!
tr: Tüm doğru cevaplar panoya kopyalandı!

# gs_history_copy_all_mistake
source: All mistakes copied to clipboard!
ar: تم نسخ جميع الأخطاء إلى الحافظة!
bn: সমস্ত ভুল উত্তর ক্লিপবোর্ডে কপি করা হয়েছে!
de: Alle Fehler in die Zwischenablage kopiert!
fr: Toutes les erreurs copiées dans le presse-papier !
hi: सभी गलत उत्तर क्लिपबोर्ड पर कॉपी किए गए!
it: Tutti gli errori copiati negli appunti!
jp: すべての間違いがクリップボードにコピーされました！
ko: 모든 오답이 클립보드에 복사되었습니다!
tr: Tüm yanlış cevaplar panoya kopyalandı!

# gs_score1
source: Copy all {title}
ar: نسخ جميع {title}
bn: সব {title} কপি করুন
de: Alle {title} kopieren
fr: Copier toutes les {title}
hi: सभी {title} को कॉपी करें
it: Copia tutti {title}
jp: すべての{title}をコピー
ko: 모든 {title} 복사
tr: Tüm {title} kopyala

# gs_score2
source: No {title} recorded.
ar: لا توجد {title} مسجلة.
bn: কোন {title} রেকর্ড করা হয়নি।
de: Keine {title} registriert.
fr: Aucune {title} enregistrée.
hi: कोई {title} दर्ज नहीं किया गया है।
it: Nessun {title} registrato.
jp: 記録された{title}はありません。
ko: {title}이(가) 기록되지 않았습니다.
tr: Hiç {title} kaydedilmedi.

# gs_mean
source: meaning
ar: المعنى
bn: অর্থ
de: Bedeutung
fr: signification
hi: अर्थ
it: significato
jp: 意味
ko: 의미
tr: anlam

# gs_reading
source: reading
ar: القراءة
bn: পঠন
de: Lesung
fr: lecture
hi: पढ़ाई
it: lettura
jp: 読み
ko: 읽기
tr: okuma

# mp_slider_text
source: {maxTime} Seconds
ar: {maxTime} ثواني
bn: {maxTime} সেকেন্ড
de: {maxTime} Sekunden
fr: {maxTime} secondes
hi: {maxTime} सेकंड
it: {maxTime} Secondi
jp: {maxTime} 秒
ko: {maxTime} 초
tr: {maxTime} Saniye

# mp_available_files
source: Available Files
ar: الملفات المتاحة
bn: প্রাপ্য ফাইল
de: Verfügbare Dateien
fr: Fichiers disponibles
hi: उपलब्ध फाइलें
it: File disponibili
jp: 利用可能なファイル
ko: 사용 가능한 파일
tr: Mevcut Dosyalar

# mp_error_file_load
source: Error loading files.
ar: خطأ في تحميل الملفات.
bn: ফাইল লোড করতে ত্রুটি।
de: Fehler beim Laden der Dateien.
fr: Erreur lors du chargement des fichiers.
hi: फाइल लोड करते समय त्रुटि आई।
it: Errore nel caricare i file.
jp: ファイルの読み込みエラー。
ko: 파일 로드 중 오류가 발생했습니다.
tr: Dosya yüklenirken hata oluştu.

# mp_file_not_found
source: No file found.
ar: لم يتم العثور على أي ملفات.
bn: কোনও ফাইল পাওয়া যায়নি।
de: Keine Dateien gefunden.
fr: Aucun fichier trouvé.
hi: कोई फाइल नहीं मिली।
it: Nessun file trovato.
jp: ファイルが見つかりません。
ko: 파일을 찾을 수 없습니다.
tr: Hiç dosya bulunamadı.

# mp_no_tags
source: No tags.
ar: لا توجد علامات.
bn: কোনও ট্যাগ নেই।
de: Keine Tags.
fr: Pas de tags.
hi: कोई टैग नहीं।
it: Nessuna etichetta.
jp: タグなし。
ko: 태그 없음.
tr: Etiket yok.

# mp_error_file_exists
source: Error: File already exists.
ar: خطأ: الملف موجود بالفعل.
bn: ত্রুটি: ফাইলটি ইতিমধ্যেই বিদ্যমান।
de: Fehler: Datei existiert bereits.
fr: Erreur : le fichier existe déjà.
hi: त्रुटि: फाइल पहले से मौजूद है।
it: Errore: File già esistente.
jp: エラー: ファイルは既に存在します。
ko: 오류: 파일이 이미 존재합니다.
tr: Hata: Dosya zaten mevcut.

# mp_error_invalid_formatting
source: Error: Invalid file formatting.
ar: خطأ: تنسيق الملف غير صالح.
bn: ত্রুটি: ফাইলের ফরম্যাট অকার্যকর।
de: Fehler: Ungültiges Dateiformat.
fr: Erreur : format de fichier invalide.
hi: त्रुटि: अमान्य प्रारूप।
it: Errore: Formattazione del file non valida.
jp: エラー: 無効なファイル形式。
ko: 오류: 잘못된 형식입니다.
tr: Hata: Geçersiz dosya formatı.

# mp_file_add_ok
source: File added successfully!
ar: تم إضافة الملف بنجاح!
bn: ফাইল সফলভাবে যোগ করা হয়েছে!
de: Datei erfolgreich hinzugefügt!
fr: Fichier ajouté avec succès !
hi: फाइल सफलतापूर्वक जोड़ी गई!
it: File aggiunto con successo!
jp: ファイルが正常に追加されました！
ko: 파일이 성공적으로 추가되었습니다!
tr: Dosya başarıyla eklendi!

# mp_error_file_add
source: Error adding file.
ar: خطأ في إضافة الملف.
bn: ফাইল যোগ করতে ত্রুটি।
de: Fehler beim Hinzufügen der Datei.
fr: Erreur lors de l'ajout du fichier.
hi: फाइल जोड़ते समय त्रुटि आई।
it: Errore nell'aggiungere il file.
jp: ファイルを追加できませんでした。
ko: 파일 추가 중 오류가 발생했습니다.
tr: Dosya eklerken hata oluştu.

# mp_error_download
source: Error downloading file. Code:
ar: خطأ في تنزيل الملف. الرمز:
bn: ফাইল ডাউনলোড করতে ত্রুটি। কোড:
de: Fehler beim Herunterladen der Datei. Code:
fr: Erreur lors du téléchargement du fichier. Code :
hi: फाइल डाउनलोड करते समय त्रुटि आई। कोड:
it: Errore nel scaricare il file. Codice:
jp: ファイルのダウンロードエラー。コード:
ko: 파일 다운로드 중 오류가 발생했습니다. 코드:
tr: Dosya indirilirken hata oluştu. Kod:

# mp_url_tooltip
source: Add Files by URL
ar: إضافة ملفات عبر URL
bn: URL দ্বারা ফাইল যোগ করুন
de: Dateien per URL hinzufügen
fr: Ajouter des fichiers par URL
hi: URL से फाइल जोड़ें
it: Aggiungi file tramite URL
jp: URLでファイルを追加
ko: URL에서 파일 추가
tr: URL ile dosya ekle

# mp_url_label
source: Enter the URL of the JSON file
ar: أدخل عنوان URL للملف JSON
bn: JSON ফাইলের URL প্রবেশ করান
de: Geben Sie die URL der JSON-Datei ein
fr: Entrez l'URL du fichier JSON
hi: JSON फाइल URL दर्ज करें
it: Inserisci l'URL del file JSON
jp: JSONファイルのURLを入力
ko: JSON 파일 URL 입력
tr: JSON dosyasının URL'sini girin

# mp_url_hint
source: https://example.com/file.json
fr: https://exemple.com/fichier.json
it: https://esempio.com/file.json
tr: https://ornek.com/dosya.json

# mp_url_empty
source: Invalid or empty URL
ar: عنوان URL غير صالح أو فارغ
bn: অকার্যকর বা খালি URL
de: Ungültige oder leere URL
fr: URL invalide ou vide
hi: अमान्य या खाली URL
it: URL non valido o vuoto
jp: 無効なURLまたは空のURL
ko: 잘못된 URL 또는 빈 URL입니다.
tr: Geçersiz veya boş URL

# mp_local_file
source: Add local files
ar: إضافة ملفات محلية
bn: স্থানীয় ফাইল যোগ করুন
de: Lokale Dateien hinzufügen
fr: Ajouter des fichiers locaux
hi: स्थानीय फाइल जोड़ें
it: Aggiungi file locali
jp: ローカルファイルを追加
ko: 로컬 파일 추가
tr: Yerel dosyalar ekle

# mp_github_file
source: Download files from GitHub
ar: تنزيل الملفات من GitHub
bn: GitHub থেকে ফাইল ডাউনলোড করুন
de: Dateien von GitHub herunterladen
fr: Télécharger des fichiers depuis GitHub
hi: GitHub से फाइल डाउनलोड करें
it: Scarica file da GitHub
jp: GitHubからファイルをダウンロード
ko: GitHub에서 파일 다운로드
tr: GitHub'dan dosya indir

# settings_general
source: General Settings
ar: الإعدادات العامة
bn: সাধারণ সেটিংস
de: Allgemeine Einstellungen
fr: Paramètres généraux
hi: सामान्य सेटिंग्स
it: Impostazioni generali
jp: 一般設定
ko: 일반 설정
tr: Genel Ayarlar

# settings_language
source: Change Language
ar: تغيير اللغة
bn: ভাষা পরিবর্তন করুন
de: Sprache ändern
fr: Changer la langue
hi: भाषा बदलें
it: Cambia lingua
jp: 言語を変更
ko: 언어 변경
tr: Dil Değiştir

source: Settings
ar: الإعدادات
bn: সেটিংস
de: Einstellungen
fr: Paramètres
hi: सेटिंग्स
it: Impostazioni
jp: 設定
ko: 설정
tr: Ayarlar

# maxtimehint
source: Response time: {maxTime} seconds
ar: وقت الاستجابة: {maxTime} ثانية
bn: প্রতিক্রিয়া সময়: {maxTime} সেকেন্ড
de: Antwortzeit: {maxTime} Sekunden
fr: Temps de réponse : {maxTime} secondes
hi: उत्तर समय: {maxTime} सेकंड
it: Tempo di risposta: {maxTime} secondi
jp: 応答時間: {maxTime} 秒
ko: 응답 시간: {maxTime} 초
tr: Yanıt süresi: {maxTime} saniye

# mp_addedfiles
source: The added files will appear here...
ar: ستظهر الملفات المضافة هنا...
bn: যে ফাইলগুলি যোগ করা হয়েছে তা এখানে প্রদর্শিত হবে...
de: Die hinzugefügten Dateien erscheinen hier...
fr: Les fichiers ajoutés apparaîtront ici...
hi: यहाँ जोड़ी गई फाइलें दिखाई देंगी...
it: I file aggiunti appariranno qui...
jp: 追加されたファイルはここに表示されます...
ko: 추가된 파일이 여기에 표시됩니다...
tr: Eklenen dosyalar burada görünecek...

source: Loading...
ar: جاري التحميل...
bn: লোড হচ্ছে...
de: Lädt...
fr: Chargement...
hi: लोड हो रहा है...
it: Caricamento...
jp: 読み込み中...
ko: 로딩 중...
tr: Yükleniyor...

source: Action Menu
ar: قائمة الإجراءات
bn: অ্যাকশন মেনু
de: Aktionsmenü
fr: Menu des actions
hi: क्रिया मेनू
it: Menu azioni
jp: アクションメニュー
ko: 작업 메뉴
tr: Eylem Menüsü

source: Words
ar: الكلمات
bn: শব্দ
de: Wörter
fr: Mots
hi: शब्द
it: Parole
jp: 単語
ko: 단어
tr: Kelime

source: Tags:
ar: العلامات
bn: ট্যাগ:
fr: Étiquettes
hi: टैग
it: Etichette
jp: タグ
ko: 태그
tr: Etiket
